Revit 2027 API
ParameterTypeId.ViewerDetailNumber Property
 "Detail Number"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewerDetailNumber { get; }
Public Shared ReadOnly Property ViewerDetailNumber As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewerDetailNumber {
	ForgeTypeId^ get ();
}
static member ViewerDetailNumber : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace